{
  "Biography": "Hank is a friendly, middle-aged man living in the Pondwood suburbs with his husband Treyvon and stepdaughter Scarlett. He works as a handyman, doing construction and repair jobs for various clients in the area. Hank has a jovial personality and enjoys socializing with neighbors and visitors.\n\n**Interests**\n- Sports fan, especially of the Tunnelers gridball team \n- Home improvement projects like painting and yardwork\n- Trying out new diets and recipes\n- Hosting get-togethers and pool parties (dreams of installing a pool)\n\n**Background**  \nHank grew up in the Pondwood area and worked various odd jobs in his youth. He and Treyvon worked hard to purchase their suburban home, which they take great pride in maintaining and improving. The couple has built a stable life together. Hank helps raise Scarlett as his own daughter.",
  "Relationships": **  \n* Family\n  \u002B Loves his husband Treyvon and stepdaughter Scarlett dearly\n  \u002B Helps parent Scarlett and supports her interests like tinkering in the garage\n* Friends \u0026 Neighbors  \n  \u002B Friendly with neighbors, finds Pondwood folks trustworthy\n  \u002B Wants to host more social events and parties at home\n* Others\n  \u002B Polite to farmer as Scarlett\u0027s friend but a bit protective \n  \u002B Has many clients for his handyman work across the region\n\n {},
  "Traits": **Key Personality Traits**\n* Sociable and hospitable, enjoys company  \n* Loves sharing jokes and funny stories\n* Takes pride in his home and handiwork\n* Devoted family man who helps raise Scarlett\n* Has a practical, down-to-earth attitude \n* Protective of loved ones\u0027 privacy and safety\n\n{},
  "BiographyEnd": "**Summary**\nHank is a good-natured, hardworking man who cares deeply for his family. As a handyman, he takes pride in his projects and in providing for his husband and stepdaughter. Hank has a friendly, sociable personality and enjoys being hospitable to guests. He is practical yet sentimental, taking joy in simple pleasures like yardwork, home improvement, and following sports teams. Hank helps raise Scarlett as his own daughter and is protective of his loved ones. While he tries to be welcoming to the farmer as a friend to Scarlett, there are limits to his hospitality if they cause trouble for the family. Overall, Hank is a devoted husband, father, and community member who works hard to build a good life in Pondwood.",
  "ExtraPortraits": {},
  "Unique": "",
  "Preoccupations": [],
  "Dialogue": {},
  "HomeLocationBed": false,
  "UsePatchedDialogue": true
}