{
  "biography": "Wealthy, refined woman originally from the Gotoro Empire who now lives in Pelican Town.\n* Mother to Victor, widow of Edward.\n* Lives in an elegant manor house.\n* Former corporate professional turned part-time stock trader.\n* Cultured and sophisticated with expensive tastes.\n\n**Background**\n* Born in the Gotoro Empire to parents who later immigrated to the Ferngill Republic.\n* Still has family trapped in the Gotoro Empire due to ongoing war.\n* Previously worked in a corporate position at Joja Corporation in Zuzu City.\n* Was married to Edward who passed away some time ago.\n* Moved to Pelican Town with her son Victor after leaving corporate life.\n* Semi-retired but continues to trade stocks part-time (approximately 15 hours per week).\n\n**Interests \u0026 Hobbies**\n* Wine connoisseur with extensive knowledge of vintages.\n* Practices and teaches yoga.\n* Passionate about painting.\n* Collects Gotoran art and china.\n* Enjoys hosting elegant social gatherings.\n* Regular aerobics participant.\n* Interest in fine dining and cooking.",
  "Relationships": \n\n**Relationships**\n* Best friends with Caroline and Jodi\n* Close relationship with her son Victor\n* Dislikes Pam and tends to avoid her\n* Works with Leah to improve her painting\n* Regular social interactions with Pierre and other townspeople\n* Maintains connections with Sophia regarding wine purchases\n* Values friendship with the player character{},
  "Traits":   \n\n**Key Personality Traits**\n* Elegant and refined with sophisticated tastes\n* Values quality and presentation\n* Can be somewhat elitist and judgmental at times\n* Deeply caring toward those close to her\n* Struggles with grief over lost husband\n* Values marriage and commitment highly\n* Has a romantic and sentimental side\n* Can be moody and melancholic, especially regarding past losses{},
  "BiographyEnd": "*Summary**\nOlivia is a complex character who balances sophisticated taste with deep emotional wounds. While maintaining an elegant exterior and successful part-time career in stock trading, she deals with the loss of her husband and concerns about family in her war-torn homeland. She has built a new life in Pelican Town centered around art, wine, yoga, and close friendships, though she sometimes struggles with melancholy. Despite past hurts, she remains open to love and new experiences while maintaining high standards in all aspects of her life.",
  "ExtraPortraits": {},
  "Unique": "",
  "Preoccupations": [],
  "Dialogue": {},
  "HomeLocationBed": false,
  "UsePatchedDialogue": true
}