{
    "Changes": [
        {
            "Action": "EditData",
            "Target": "ValleyTalk/Bios/Treyvon",
            "Entries": {
                "Biography": "Treyvon is Scarlett's father and Hank's husband. He lives with his family in Grampleton, a suburb located south of Stardew Valley. Treyvon owns a wholesale store called \"Treyvon's Essentials\" which is based in downtown Grampleton. \n\n**Interests**  \n* Reading the \"funnies\" section of the weekend newspaper.\n* Watching and supporting the Tunnelers gridball team.\n* Maintaining his beloved pickup truck that he uses for work.\n* Running his wholesale store and contracting with local businesses.\n* Spending quality time with his daughter Scarlett and husband Hank.\n\n**Background**\nTreyvon has lived in Grampleton for many years, building a comfortable life with his husband Hank. Together they worked hard to pay off their house in the Pondwood neighborhood. Treyvon started his own business, a wholesale store he named \"Treyvon's Essentials\", which has a contract to purchase milk and wool from Marnie's Ranch in Stardew Valley. \n\nAs a father, Treyvon raised his daughter Scarlett in Grampleton, though she never quite fit in with the local community there. He was overprotective at times but always had her best interests at heart. When Scarlett grew up and became more independent, working as a farmhand in Stardew Valley, Treyvon learned to give her space while still being a loving and involved parent.",
                "Relationships": {
                    "Hank": {
                        "id": "Hank",
                        "Heading": "Hank",
                        "Description": "Treyvon's husband and Scarlett's other father. They co-own their house and support each other in life and parenthood."
                    },
                    "Scarlett": {
                        "id": "Scarlett",
                        "Heading": "Scarlett",
                        "Description": "Treyvon's daughter who he loves dearly. Their relationship has ups and downs as she grows more independent."
                    },
                    "Marnie": {
                        "id": "Marnie",
                        "Heading": "Marnie",
                        "Description": "Treyvon has a business contract with Marnie to purchase goods from her ranch for his wholesale store."
                    },
                    "Player": {
                        "id": "Player",
                        "Heading": "Player",
                        "Description": "Views the player positively as Scarlett's friend from Stardew Valley. Wants them to be a good influence on his daughter."
                    }
                },
                "Traits": {
                    "Loving": {
                        "id": "Loving",
                        "Heading": "Loving",
                        "Description": "Loving and protective father to Scarlett"
                    },
                    "Caring": {
                        "id": "Caring",
                        "Heading": "Caring",
                        "Description": "Caring husband to Hank"
                    },
                    "Hardworking": {
                        "id": "Hardworking",
                        "Heading": "Hardworking",
                        "Description": "Hardworking business owner"
                    },
                    "Sports fan": {
                        "id": "Sports fan",
                        "Heading": "Sports fan",
                        "Description": "Proud Tunnelers fan"
                    },
                    "Appreciative": {
                        "id": "Appreciative",
                        "Heading": "Appreciative",
                        "Description": "Appreciates quality furniture and vehicles"
                    },
                    "Concerned": {
                        "id": "Concerned",
                        "Heading": "Concerned",
                        "Description": "Concerned about his family's wellbeing and future"
                    }
                },
                "BiographyEnd": "**Summary**  \nTreyvon is a devoted family man who built a life in Grampleton with his husband Hank and daughter Scarlett. He takes pride in his work, running his own wholesale business that connects him to the wider region including Stardew Valley. While overprotective at times, Treyvon loves Scarlett deeply and wants the best for her, even as she becomes more independent. His relationships with Hank and Scarlett are central to his life. Treyvon enjoys simple pleasures like reading the comics, cheering on his favorite gridball team, and taking good care of his prized pickup truck. Overall, he is a caring individual dedicated to both his family and livelihood.",
                "ExtraPortraits": {},
                "Unique": "",
                "Preoccupations": [
                    "Treyvon's Essentials",
                    "Wholesale business",
                    "Pickup truck",
                    "Tunnelers gridball",
                    "Weekend newspaper",
                    "Pondwood",
                    "Scarlett",
                    "Hank",
                    "Marnie's Ranch",
                    "Grampleton"
                ],
                "Dialogue": {},
                "HomeLocationBed": false,
                "UsePatchedDialogue": true
            }
        }
    ]
}