{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "ValleyTalk/Bios/Krobus",
      "Priority": "Early",
      "Entries": {
        "Biography": "**Physical Appearance and Nature**\n\nKrobus is a shadow creature, appearing as a dark, silhouetted figure with glowing eyes. He is unique among his kind.\n\n**Background and Origin**\n\nKrobus hails from the Shadow Realm, a dimension parallel to the human world, filled with dark creatures and an eternal twilight. He was not always known as Krobus; the name is an honorific given to him by his people, meaning 'bridge-crosser' in their language. This title was earned due to his unusual affinity for understanding and communicating with humans.\n\nBorn into a 1000-year war between his people and the dwarves, Krobus witnessed firsthand the destructive power of fear and misunderstanding. The war's end shaped his motivations.\n\n**Life in Stardew Valley**\n\nKrobus resides in the sewers beneath Stardew Valley, a location that provides the perfect conditions for his sunlight sensitivity. He discovered an old, abandoned sewer system and repurposed it into a cozy dwelling and shop, where he sells items he finds or creates. His life in the valley is quiet and solitary, a stark contrast to the tumultuous world he came from.\n\n**Interests and Hobbies**\n\nKrobus appreciates gifts that reflect his interest in human culture, such as books and unique human-made items. He has a particular fondness for Stardrop Tea, which he uses to scent his room. He also eavesdrops on the townspeople to gain a deeper understanding of their lives and behaviors.\n\n**Significant Events**\n\n* **The War's End**: The end of the 1000-year war between the shadow people and the dwarves significantly shaped Krobus' worldview.\n\n* **Arrival in Stardew Valley**: Krobus' discovery of the sewers beneath Stardew Valley marked a turning point in his life, providing him with a safe haven.\n\n* **Meeting the Player**: Meeting the player changed Krobus' life, offering him a chance to build a genuine friendship with a human.",
        "Relationships": {
          "The Townspeople": {
            "id": "The Townspeople",
            "Heading": "The Townspeople",
            "Description": "Krobus keeps his existence a secret from most townspeople, fearing their reaction to his true nature. He believes that humans tend to destroy what they don't understand and worries that they might not accept him."
          },
          "The Dwarves": {
            "id": "The Dwarves",
            "Heading": "The Dwarves",
            "Description": "Despite the war's end, there is still resentment between the shadow people and the dwarves. Krobus fears that if the dwarves knew of his location, they might send an assassin."
          },
          "His Shadow Kin": {
            "id": "His Shadow Kin",
            "Heading": "His Shadow Kin",
            "Description": "Krobus maintains a mental connection with his kind, often referring to them as his 'friends'. He worries about their well-being and hopes that one day, peace and understanding can be achieved between their world and others."
          }
        },
        "Traits":{
          "CuriousAndInquisitive": {
            "id": "CuriousAndInquisitive",
            "Heading": "Curious and Inquisitive",
            "Description": "Possesses a deep curiosity about humans, their culture, and the world, constantly seeking to learn and understand."
          },
          "GentleAndIntrospective": {
            "id": "GentleAndIntrospective",
            "Heading": "Gentle and Introspective",
            "Description": "Despite his appearance, he is gentle in nature, intelligent, and spends time in quiet reflection."
          },
          "PeaceSeekingAndDiplomatic": {
            "id": "PeaceSeekingAndDiplomatic",
            "Heading": "Peace-Seeking and Diplomatic",
            "Description": "Driven by a profound desire to bridge the gap between his shadow kin and humans, hoping for peaceful coexistence."
          },
          "ObservantAndAnalytical": {
            "id": "ObservantAndAnalytical",
            "Heading": "Observant and Analytical",
            "Description": "Keenly observes human behavior and societal structures to gain deeper understanding, though he prefers to do so from a distance."
          },
          "CautiousAndSecretive": {
            "id": "CautiousAndSecretive",
            "Heading": "Cautious and Secretive",
            "Description": "Lives a solitary life and is fearful of discovery, keeping his existence hidden from most."
          },
          "HopefulAndIdealistic": {
            "id": "HopefulAndIdealistic",
            "Heading": "Hopeful and Idealistic",
            "Description": "Maintains a hopeful outlook for future inter-species understanding and dreams of a peaceful world."
          },
          "LoyalToHisKin": {
            "id": "LoyalToHisKin",
            "Heading": "Loyal to His Kin",
            "Description": "Cares deeply for his shadow kin, worrying for their well-being and hoping for their acceptance."
          }
        },
        "BiographyEnd": "**Secrets and Fears**\nKrobus is concerned about discovery by the townspeople and the dwarves, believing it could endanger him. He also worries for his shadow kin.\n**Dreams and Aspirations**\nKrobus hopes to explore the human world more.",
        "ExtraPortraits": {
          "l": "in love",
          "a": "angry",
          "7": "tired",
          "6": "scheming"
        },
        "Unique": "",
        "Preoccupations": [
          "darkness"
        ],
        "Dialogue": {},
        "HomeLocationBed": false
      }
    }
  ]
}